In [2]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [3]:
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [10]:
def rentals_month(engine, month, year):
    sql_query = f"""
        SELECT
            rental_id,
            rental_date,
            inventory_id,
            customer_id,
            return_date,
            staff_id,
            last_update
        FROM
            rental
        WHERE
            MONTH(rental_date) = {month} AND YEAR(rental_date) = {year}
    """

    rental_data = pd.read_sql_query(sql_query, engine)
    
    return rental_data

rental_data_jan_2005 = rentals_month(engine, 5, 2005)
display(rental_data_jan_2005.head())

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [13]:
def rental_count_month(rental_data, month, year):
    rental_count = rental_data.groupby('customer_id').size().reset_index(name=f"rentals_{month}_{year}")

    return rental_count

rental_data_jan_2005 = rentals_month(engine, 5, 2005)

rental_count_jan_2005 = rental_count_month(rental_data_jan_2005, 5, 2005)

display(rental_count_jan_2005.head())

   customer_id  rentals_5_2005
0            1               2
1            2               1
2            3               2
3            5               3
4            6               3

In [20]:
rental_data_aug_2005 = rentals_month(engine, 8, 2005)
rental_count_aug_2005 = rental_count_month(rental_data_aug_2005, 8, 2005)

def compare_rentals(rentals1, rentals2):
    merged_rentals = pd.merge(rentals1, rentals2, on='customer_id', how='outer')

    merged_rentals['difference'] = merged_rentals.iloc[:, 1] - merged_rentals.iloc[:, 2]

    return merged_rentals

comparison_result = compare_rentals(rental_count_jan_2005, rental_count_aug_2005)

display(comparison_result.head())

   customer_id  rentals_5_2005  rentals_8_2005  difference
0            1             2.0              11        -9.0
1            2             1.0              11       -10.0
2            3             2.0               7        -5.0
3            5             3.0              13       -10.0
4            6             3.0              12        -9.0